Revit 2027 API
Definition.Name Property
The user visible name for the parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract string Name { get; }
Public MustOverride ReadOnly Property Name As String
	Get
public:
virtual property String^ Name {
	String^ get () abstract;
}
abstract Name : string with get
Property Value
String
See Also
Reference
Definition Class
Autodesk.Revit.DB Namespace